Revit 2024 API
PointCloudColorSettings.Color1 Property
 Color 1
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public Color Color1 { get; }
Visual Basic
Public ReadOnly Property Color1 As Color
	Get
Visual C++
public:
property Color^ Color1 {
	Color^ get ();
}
See Also
PointCloudColorSettings Class
Autodesk.Revit.DB.PointClouds Namespace